<a href="https://colab.research.google.com/github/ThilakaAaryan/Data-Science/blob/main/AWS_%3ESQL_%3EPYTHON.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.0.0-cp310-cp310-manylinux_2_17_x86_64.whl.metadata (2.0 kB)
Downloading mysql_connector_python-9.0.0-cp310-cp310-manylinux_2_17_x86_64.whl (19.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 19.3/19.3 MB 59.8 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.0.0

In [2]:
import mysql.connector

In [5]:
server = mysql.connector.connect(host = 'database-1.c1g8qkg02il1.ap-south-1.rds.amazonaws.com', user = 'admin',password = 'ThilakaJay')
server

In [10]:
Thilaka = server.cursor()

In [11]:
Thilaka.execute('show databases')

In [12]:
for i in Thilaka:
  print(i)

('Thilaka',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [13]:
server = mysql.connector.connect(host = 'database-1.c1g8qkg02il1.ap-south-1.rds.amazonaws.com', user = 'admin',password = 'ThilakaJay',database = 'Thilaka',port=3306)

In [14]:
Thilakajay = server.cursor()

In [ ]:
Thilakajay.execute('''create table emp1
(emp_id int primary key,
emp_name varchar(20),
salary float,
department_id int)''')

In [16]:
server.commit()

In [ ]:
Thilakajay.execute('''insert into emp1 values
(200, 'karthik', 10000, 100),
(201, 'shalini', 15000, 101),
(202, 'sanjay', 12000.50, 102),
(203, 'radha', 13000.25, 100),
(204, 'dinesh', 11000, 100),
(205, 'ajay', 10000, 105),
(206, 'kannan', 14000, 105)''')

In [17]:
server.commit()

In [18]:
Thilakajay.execute('select * from emp1')

In [19]:
x = Thilakajay.fetchall()

In [20]:
print(x)

[(200, 'karthik', 10000.0, 100), (201, 'shalini', 15000.0, 101), (202, 'sanjay', 12000.5, 102), (203, 'radha', 13000.2, 100), (204, 'dinesh', 11000.0, 100), (206, 'kannan', 14000.0, 105)]

In [ ]:
Thilakajay.execute('''create table dept
(dept_id int primary key,
dept_name varchar(20))''')

server.commit()

In [ ]:
Thilakajay.execute('''insert into dept
values
(100, 'finance'),
(101, 'admin'),
(102, 'IT'),
(103, 'account'),
(104, 'HR')''')

server.commit()

In [21]:
Thilakajay.execute("select * from dept")

In [22]:
data = Thilakajay.fetchall()
print(data)

[(100, 'finance'), (101, 'admin'), (102, 'IT'), (103, 'account'), (104, 'HR')]

In [25]:
Thilakajay.execute('''select emp1.emp_id, emp1.emp_name,emp1.salary,emp1.department_id, dept.dept_id, dept.dept_name
from emp1 inner join dept on emp1.department_id = dept.dept_id''')

In [26]:
y = Thilakajay.fetchall()
print(y)

[(200, 'karthik', 10000.0, 100, 100, 'finance'), (201, 'shalini', 15000.0, 101, 101, 'admin'), (202, 'sanjay', 12000.5, 102, 102, 'IT'), (203, 'radha', 13000.2, 100, 100, 'finance'), (204, 'dinesh', 11000.0, 100, 100, 'finance')]

In [24]:
Thilakajay.execute('select * from emp1')
Thilakajay.fetchall()

[(200, 'karthik', 10000.0, 100),
 (201, 'shalini', 15000.0, 101),
 (202, 'sanjay', 12000.5, 102),
 (203, 'radha', 13000.2, 100),
 (204, 'dinesh', 11000.0, 100),
 (206, 'kannan', 14000.0, 105)]

In [27]:
Thilakajay.execute("delete from emp1 where emp_id = 205 ")
server.commit()

In [28]:
Thilakajay.execute('select * from emp1')
Thilakajay.fetchall()

[(200, 'karthik', 10000.0, 100),
 (201, 'shalini', 15000.0, 101),
 (202, 'sanjay', 12000.5, 102),
 (203, 'radha', 13000.2, 100),
 (204, 'dinesh', 11000.0, 100),
 (206, 'kannan', 14000.0, 105)]